templates_orig/0_org/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11                                  	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    Mammut
    {
        type MRFnoSlip;
        MRFZoneName zone1;
    }

    wand
    {
        type	        fixedValue;
        value           uniform (0 0 0);
    }

    boden
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    oben
    {
        type            slip;
    }

}

// ************************************************************************* //
