templates_orig/0_org/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11                                  	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.0001;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    Mammut
    {
        type	        kqRWallFunction;
        value           $internalField;
    }
    
    wand
    {
        type	        kqRWallFunction;
        value           $internalField;
    }

    boden
    {
        type	        kqRWallFunction;
        value           $internalField;
    }

    oben
    {
        type	        slip;
    }



}

// ************************************************************************* //
