templates_orig/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
convertToMeters 1;

xMax    13.1;
xMin    -13.1;
yMax    13.1;
yMin    -13.1;
zMax    5.6;
zMin    -0.1;

xCells  201;
yCells  201;
zCells  39;


verbose no;

scale 1;

vertices
(

    ($xMin  $yMin $zMin)
    ($xMax  $yMin $zMin)
    ($xMin  $yMax $zMin)
    ($xMax  $yMax $zMin)

    ($xMin  $yMin $zMax)
    ($xMax  $yMin $zMax)
    ($xMin  $yMax $zMax)
    ($xMax  $yMax $zMax)

);

blocks
(
    hex (0 1 3 2 4 5 7 6) 

    ($xCells $yCells $zCells) 

    simpleGrading (1 1 1)
);

edges
(

);

defaultPatch
{
    type patch;
}

boundary
(
);


// ************************************************************************* //
