templates_orig/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    //default         Gauss linear;
    //grad(p)         Gauss linear;

    //default 	     leastSquares;
    //default 	     cellMDLimited leastSquares 0.5;

    default 	     cellLimited Gauss linear 1;
    grad(U) 	     cellLimited Gauss linear 1;
}

divSchemes
{
    default         none;

    //div(phi,U)      bounded Gauss linear;
    //div(phi,U)      boundedGauss limitedLinearV 1;
    //div(phi,U)      bounded Gauss upwind;
    div(phi,U)      bounded Gauss linearUpwind grad(U);

    div(phi,omega)      Gauss linearUpwind default;
    div(phi,k)      	Gauss linearUpwind default;

    div((nuEff*dev2(T(grad(U)))))	Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear limited 1;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         limited 1;
}

wallDist
{
    method         meshWave;
}

// ************************************************************************* //
