templates_orig/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
/*
    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0;

	minIter 	2;
    }
*/

    p
    {
        solver           GAMG;
        tolerance        1e-6;
        relTol           0.01;
        smoother         GaussSeidel;
        nPreSweeps       0;
        nPostSweeps      2;
        cacheAgglomeration on;
        agglomerator     faceAreaPair;
        nCellsInCoarsestLevel 100;
        mergeLevels      1;

	minIter 	2;
    }

    pFinal
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0;
	    minIter		3;
    }

    "U.*"
    
    {
        solver          PBiCGStab;
        //solver          GAMG;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0;
	    minIter		3;
    }


/*
    "U.*"
    {
        type            coupled;
        solver          PBiCCCG;
        preconditioner  DILU;
        tolerance       (1e-08 1e-08 1e-08);
        relTol          (0 0 0);
    }
*/

    "omega.*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0;
	    minIter		3;
    }

    "k.*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0;
	    minIter		3;
    }

//For Poisson wallDist method
/*
    yPsi
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0;

	minIter 	2;
    }
*/
}

SIMPLE
{
    nNonOrthogonalCorrectors 2;
    pRefCell        0;
    pRefValue       0;

    consistent yes;

    residualControl
    {

        p               1e-5;
        U               1e-5;
        nuTilda         1e-5;
        k               1e-5;
        omega           1e-5;

    }
}
/*
PIMPLE
{
    nNonOrthogonalCorrectors 2;
    pRefCell        0;
    pRefValue       0;

    consistent yes;

    residualControl
    {

        p               1e-4;
        U               1e-4;
        nuTilda         1e-4;
        k               1e-4;
        omega           1e-4;

    }
}
*/
relaxationFactors
{
    fields
    {
	//".*"		0.9;
        p               0.3;
    }
    equations
    {
	//".*"		0.9;
        U               0.7;
        k               0.7;
        omega           0.7;
    }
}

// ************************************************************************* //
