templates_orig/system/triSurfaceAverage
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates the average on a specified triangulated surface by interpolating
    onto the triangles and integrating over the surface area. Triangles need to
    be small (<= cell size) for an accurate result.

\*---------------------------------------------------------------------------*/

triSurface massflow_yneg.stl;

fields  (U);

operation areaAverage;

#includeEtc "caseDicts/postProcessing/surfaceFieldValue/triSurfaceValue.cfg"

// ************************************************************************* //
